In [2]:
import pandas as pd
import numpy as np
import sklearn as sl
import matplotlib.pyplot as pl
import mlxtend as mx
import seaborn as sb

from sklearn.cluster import KMeans
from sklearn.metrics import pairwise_distances_argmin_min
from sklearn import svm

%matplotlib inline
from mpl_toolkits.mplot3d import Axes3D
pl.rcParams['figure.figsize'] = (16, 9)
pl.style.use('ggplot')

In [3]:
data=pd.read_csv("coches.csv")#Leemos el fichero csv
data

     age  gender  miles   debt  income  sales
0     28       0     23      0    4099    620
1     26       0     27      0    2677   1792
2     30       1     58  41576    6215  27754
3     26       1     25  43172    7626  28256
4     20       1     17   6979    8071   4438
..   ...     ...    ...    ...     ...    ...
958   22       0     11   8778    9829   1593
959   19       1     23   4850    3470   4742
960   28       1     28   9312    2720  12771
961   50       0     29  51343    8713  28511
962   47       1     15   3735    6406   6104

[963 rows x 6 columns]

In [4]:
data.describe()

,age,gender,miles,debt,income,sales
count,963.000000,963.000000,963.000000,963.000000,963.000000,963.000000
mean,37.971963,0.512980,27.704050,14109.004154,6176.047767,11689.860852
std,12.290838,0.500091,13.378181,18273.702481,3260.670142,8986.896921
min,19.000000,0.000000,10.000000,0.000000,0.000000,500.000000
25%,27.000000,0.000000,20.000000,1475.000000,3506.500000,3554.000000
50%,37.000000,1.000000,25.000000,6236.000000,6360.000000,9130.000000
75%,49.000000,1.000000,32.000000,16686.000000,8649.500000,19245.000000
max,60.000000,1.000000,97.000000,59770.000000,11970.000000,29926.000000

In [5]:
conditionlist = [
    (data['sales'] >= 500.0) & (data['sales'] <=3554.0),
    (data['sales'] >= 3554.0) & (data['sales'] <=9130.0),
    (data['sales'] >= 9130.0) & (data['sales'] <=19245.0),
    (data['sales'] > 19245.0)]
choicelist = [1, 2, 3, 4]
data['sales'] = np.select(conditionlist, choicelist, default='Not Specified')
data

     age  gender  miles   debt  income sales
0     28       0     23      0    4099     1
1     26       0     27      0    2677     1
2     30       1     58  41576    6215     4
3     26       1     25  43172    7626     4
4     20       1     17   6979    8071     2
..   ...     ...    ...    ...     ...   ...
958   22       0     11   8778    9829     1
959   19       1     23   4850    3470     2
960   28       1     28   9312    2720     3
961   50       0     29  51343    8713     4
962   47       1     15   3735    6406     2

[963 rows x 6 columns]

In [6]:
X=np.array(data[["age","gender","miles","debt","income"]])
y=np.array(data['sales'])

In [7]:
clf = svm.SVC(decision_function_shape='ovo')
clf.fit(X,y)

SVC(decision_function_shape='ovo')

In [8]:
solucion=clf.predict([[23,1,20,50000,6000],[30,0,40,50,70000],[20,0,20,0,0],[30,0,70,100,5000]])
print(solucion)

['4' '4' '1' '1']